import { PdrsDetect } from "$/components/PdrsDetect";
import { QnA } from "$/components/QnA";
import { FileContextProvider } from "$/contexts/FileContext/FileContext";

export default function PdrsDetectPage() {
  return (
    <FileContextProvider>
      <section className="max-w-5xl">
        <h1 className="text-3xl mb-12 font-medium text-primary/80">
          Пдрс Детект
        </h1>
        <QnA
          isOpen
          question="Як це працює?"
          answers={[
            "Завантажте відео з дрону де є окупанти (як на прикладі з відео нижче) і зачекайте поки модель прогрузиться. Результати будуть відображатися на екрані.",
            "Рекомендую використовувати комп'ютер при завантаженні файлів, адже телефони не стягують дану модель і тому детектор трохи тормозить.",
          ]}
        />
        <PdrsDetect />
        <QnA
          question="Чому мені не відмічає коректно окупантів?"
          answers={[
            "Дана модель була натренована на даних з відкритих джерел, а відповідних даних виявляється не так уже і багато.",
            "Це означає що вона може (і буде) помилятися, не відмічаючи, або відмічаючи не те що потрібно.",
            "Щоб вона якісно працювала потрібно дуже і ДУЖЕ багато відповідного відео/фото для тренувань.",
            "Тому якщо у вас є багато якісного відео з дронів з окупантами надішліть мені на почту sd.sakhro@gmail.com, я буду дуже вдячний! Якщо назбирається достатня кількість якісного відео, це дуже круто покращить результати даної моделі.",
            "Також якщо буде запит, я можу попрацювати більше над моделю для її покращення.",
          ]}
        />
        <QnA
          question="Що це за модель?"
          answers={[
            "Модель натренована на базі архітектури yolov5n. Також є наявна краща модель на базі yolov5s, але вона важча, і тому не підходить для використання на сайті, або я щось не так зробив :D",
            "В майбутньому планую натренерувати існуючі дані на базі архітектури yolov8, а також по-комбінувати з іншими моделями і архітектурами.",
          ]}
        />
        <QnA
          question="Де дістати дану модель?"
          answers={[
            "Джерело коду є на github(посилання в хедері). Там є дана модель для роботи з TensorFlow. Якщо потрібні ваги для PyTorch, то напишіть мені на пошту sd.sakhro@gmail.com.",
          ]}
        />
      </section>
    </FileContextProvider>
  );
}
